crates/bsl-metadata/fixtures/extension_metadata/extension/Documents/Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
  <Document>
    <Properties><Name>Заказ</Name><ObjectBelonging>Adopted</ObjectBelonging><ExtendedConfigurationObject>15500000-0000-0000-0000-000000000010</ExtendedConfigurationObject></Properties>
    <ChildObjects>
      <Attribute>
        <Properties>
          <Name>РасшРеквизит</Name>
          <Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>30</v8:Length></v8:StringQualifiers></Type>
        </Properties>
      </Attribute>
      <TabularSection>
        <Properties><Name>Товары</Name></Properties>
        <ChildObjects>
          <Attribute>
            <Properties>
              <Name>Количество</Name>
              <Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>15</v8:Length></v8:StringQualifiers></Type>
            </Properties>
          </Attribute>
          <Attribute>
            <Properties>
              <Name>РасшПоле</Name>
              <Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>25</v8:Length></v8:StringQualifiers></Type>
            </Properties>
          </Attribute>
        </ChildObjects>
      </TabularSection>
      <TabularSection>
        <Properties><Name>РасшТаблица</Name></Properties>
        <ChildObjects>
          <Attribute>
            <Properties>
              <Name>Добавлено</Name>
              <Type><v8:Type>xs:string</v8:Type></Type>
            </Properties>
          </Attribute>
        </ChildObjects>
      </TabularSection>
    </ChildObjects>
  </Document>
</MetaDataObject>

crates/bsl-metadata/fixtures/extension_metadata/extension/Documents/Заказ/Ext/ObjectModule.bsl
Процедура ПроверитьРасширение()
    БазовыйРеквизит = "база";
    РасшРеквизит = "расширение";
    Для каждого Строка Из Товары Цикл
        Строка.Номенклатура = "товар";
        Строка.Количество = "один";
        Строка.РасшПоле = "расширение";
        Строка.НетТакогоВЦикле = 1;
    КонецЦикла;

    НоваяСтрока = Товары.Добавить();
    НоваяСтрока.Номенклатура = "товар";
    НоваяСтрока.Количество = "один";
    НоваяСтрока.РасшПоле = "расширение";
    НоваяСтрока.НетТакогоПослеДобавить = 1;

    НоваяРасшСтрока = РасшТаблица.Добавить();
    НоваяРасшСтрока.Добавлено = "значение";
    НоваяРасшСтрока.НетТакогоВРасшТаблице = 1;

    Запрос = Новый Запрос("ВЫБРАТЬ Т.Номенклатура, Т.Количество, Т.РасшПоле, Т.НетТакогоВЗапросе ИЗ Документ.Заказ.Товары КАК Т");
КонецПроцедуры
